ERP.belugaerp/src/InformationRegisters/бг_ХарактеристикиУпаковокПаллет/бг_ХарактеристикиУпаковокПаллет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ХарактеристикиУпаковокПаллет</name>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпаковкаПаллета</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_ТипыЕдиницИзмерения/бг_ТипыЕдиницИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ТипыЕдиницИзмерения</name>
  <enumValues>
    <name>Бутылка</name>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
  </enumValues>
  <enumValues>
    <name>Паллета</name>
  </enumValues>
  <enumValues>
    <name>Дал</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ТипыИзмеряемыхВеличин/ТипыИзмеряемыхВеличин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыИзмеряемыхВеличин</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Энергия</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КоличествоШтук</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Площадь</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЭлектрическийЗаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Мощность</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Время</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ТипыУпаковокНоменклатуры/ТипыУпаковокНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыУпаковокНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Составная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Конечная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Разупаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТоварноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>УпаковкиЕдиницыИзмерения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.НаборыУпаковок</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>бг_ДатаВыбытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаДобавления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИдентификаторЕКНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодЕК_Номенклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КоличествоМестВСлое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КоличествоСлоевВПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипЕдиницыИзмерения</name>
    <type>
      <types>EnumRef.бг_ТипыЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/InformationRegisters/бг_ХарактеристикиУпаковокПаллет/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Синхронизирует номенклатуру с характеристиками упаковок (паллет). 
// Создает служебные характеристики упаковок (паллет) и записи в регистре сведений бг_ХарактеристикиУпаковокПаллет.
// Должна быть вызвана в событии ПриЗаписи справочников Номенклатура и УпаковкиЕдиницыИзмерения.
//
// Параметры:
//  Объект - СправочникОбъект.Номенкллатура, СправочникОбъект.УпаковкиЕдиницыИзмерения - Номенклатура, упаковка, которая должна быть синхронизирована с характеристиками упаковок (паллет) 
//
Процедура СинхронизироватьХарактеристикиУпаковокПаллет(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Номенклатура") Тогда
		Номенклатура = Объект.Ссылка;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.УпаковкиЕдиницыИзмерения") Тогда	
		Номенклатура = Объект.Владелец;
		Если Не ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;	
	
	ТаблицаРезультата = ХарактеристикиУпаковокПаллет(Номенклатура);	
	ЗаписатьХарактеристикиУпаковокПаллет(ТаблицаРезультата, Номенклатура);
	
КонецПроцедуры	

// Получает упаковку паллету по умолчанию для номенклатуры по данным регистра.
//
// Параметры:
// 	Номенклатура - СправочникСсылка.Номенклатура - Номенклатура, для которой надо получить упаковку паллету.
//  КэшУпаковокПаллет - Соответствие - Кэш, в котором накапливаются полученные значения для номенклатур
//  ДополнительныеПараметры - Структура - Доп. параметры. На развитие, например, фильтр по упаковкам, если для клиента
//                                        предусмотрена отгрузка только в определенных паллетах.  
//                            Ключи:
//                             * НеПроверятьУникальность - Наличие ключа отключает проверку паллеты по умолчанию
//                                                         на уникальность. Например, если у номенклатуры есть 2
//                                                         упаковки паллеты, то будет возвращена первая.
//                             * СегментИсключаемойНоменклатуры - СправочникСсылка.СегментыНоменклатуры - если задан, упаковки,
//                                                                заданные в характеристиках номенклатура сегмента исключаются.
//
// Возвращаемое значение:
//  УпаковкаПаллета - СправочникСсылка.Номенклатура - Упаковка паллета по умолчанию. 
//
Функция УпаковкаПаллетаПоУмолчанию(Номенклатура, 
	                               КэшУпаковокПаллет = Неопределено, 
								   ДополнительныеПараметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();	
	КонецЕсли;	
	
	Если ТипЗнч(КэшУпаковокПаллет) = Тип("Соответствие") Тогда
		УпаковкаПаллета = КэшУпаковокПаллет.Получить(Номенклатура);
		Если УпаковкаПаллета <> Неопределено Тогда
			Возврат УпаковкаПаллета;	
		КонецЕсли;	
	КонецЕсли;	

	НеПроверятьУникальность = Ложь;
	СегментИсключаемойНоменклатуры = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		НеПроверятьУникальность = ДополнительныеПараметры.Свойство("НеПроверятьУникальность");		
		ДополнительныеПараметры.Свойство("СегментИсключаемойНоменклатуры", СегментИсключаемойНоменклатуры);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СегментИсключаемойНоменклатуры", СегментИсключаемойНоменклатуры);
	Запрос.УстановитьПараметр("ИспользоватьСегментИсключаемойНоменклатуры", ЗначениеЗаполнено(СегментИсключаемойНоменклатуры));	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураСегмента.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТИсключаемыеУпаковки
	|ИЗ
	|	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|ГДЕ
	|	&ИспользоватьСегментИсключаемойНоменклатуры
	|	И НоменклатураСегмента.Номенклатура = &Номенклатура
	|	И НоменклатураСегмента.Сегмент = &СегментИсключаемойНоменклатуры
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бг_ХарактеристикиУпаковокПаллет.Характеристика.бг_УпаковкаПаллета КАК УпаковкаПаллета
	|ИЗ
	|	РегистрСведений.бг_ХарактеристикиУпаковокПаллет КАК бг_ХарактеристикиУпаковокПаллет
	|ГДЕ
	|	бг_ХарактеристикиУпаковокПаллет.Номенклатура = &Номенклатура
	|	И НЕ бг_ХарактеристикиУпаковокПаллет.УпаковкаПаллета.ПометкаУдаления
	|	И НЕ бг_ХарактеристикиУпаковокПаллет.Характеристика В
	|			(ВЫБРАТЬ
	|				ВТИсключаемыеУпаковки.Характеристика КАК Характеристика
	|			ИЗ
	|				ВТИсключаемыеУпаковки КАК ВТИсключаемыеУпаковки)";
	РезультатЗапроса = Запрос.Выполнить();
	
	УпаковкаПаллета = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	Если Не РезультатЗапроса.Пустой() Тогда
		МассивУпаковокПаллет = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("УпаковкаПаллета");
		Если МассивУпаковокПаллет.Количество() = 1
			Или НеПроверятьУникальность Тогда
			УпаковкаПаллета = МассивУпаковокПаллет[0];
		КонецЕсли;	
	КонецЕсли;
	
	Если ТипЗнч(КэшУпаковокПаллет) = Тип("Соответствие") Тогда
		КэшУпаковокПаллет.Вставить(Номенклатура, УпаковкаПаллета);
	КонецЕсли;	
	
	Возврат УпаковкаПаллета;
	
КонецФункции
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьХарактеристикиУпаковокПаллет(ТаблицаРезультата, Номенклатура)

	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.бг_ХарактеристикиУпаковокПаллет.СоздатьНаборЗаписей();
	
	НетВнешнейТранзакции = Не ТранзакцияАктивна();
	
	Если НетВнешнейТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ТаблицаРезультата", ТаблицаРезультата);
		
		Запрос.Текст = 
		#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ТаблицаЗаписей.Номенклатура КАК Номенклатура,
		|	ТаблицаЗаписей.УпаковкаПаллета КАК УпаковкаПаллета,
		|	ТаблицаЗаписей.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТаблицаРезультата
		|ИЗ
		|	&ТаблицаРезультата КАК ТаблицаЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаЗаписей.Номенклатура КАК Номенклатура,
		|	ТаблицаЗаписей.УпаковкаПаллета КАК УпаковкаПаллета,
		|	ТаблицаЗаписей.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТаблицаРегистра
		|ИЗ
		|	РегистрСведений.бг_ХарактеристикиУпаковокПаллет КАК ТаблицаЗаписей
		|ГДЕ
		|	ТаблицаЗаписей.Номенклатура = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРегистра.Номенклатура КАК Номенклатура,
		|	ТаблицаРегистра.УпаковкаПаллета КАК УпаковкаПаллета,
		|	ТаблицаРегистра.Характеристика КАК Характеристика
		|ИЗ
		|	ТаблицаРегистра КАК ТаблицаРегистра
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРезультата КАК ТаблицаРезультата
		|		ПО ТаблицаРегистра.Номенклатура = ТаблицаРезультата.Номенклатура
		|			И ТаблицаРегистра.УпаковкаПаллета = ТаблицаРезультата.УпаковкаПаллета
		|ГДЕ
		|	ТаблицаРезультата.Номенклатура ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРезультата.Номенклатура КАК Номенклатура,
		|	ТаблицаРезультата.УпаковкаПаллета КАК УпаковкаПаллета,
		|	ТаблицаРезультата.Характеристика КАК Характеристика
		|ИЗ
		|	ТаблицаРезультата КАК ТаблицаРезультата
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРегистра КАК ТаблицаРегистра
		|		ПО ТаблицаРезультата.Номенклатура = ТаблицаРегистра.Номенклатура
		|			И ТаблицаРезультата.УпаковкаПаллета = ТаблицаРегистра.УпаковкаПаллета
		|ГДЕ
		|	(ТаблицаРегистра.Номенклатура ЕСТЬ NULL
		|			ИЛИ ТаблицаРезультата.УпаковкаПаллета <> ТаблицаРегистра.УпаковкаПаллета
		|			ИЛИ ТаблицаРезультата.Характеристика <> ТаблицаРегистра.Характеристика)	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаРезультата.Характеристика КАК Характеристика,
		|	ВЫРАЗИТЬ(ТаблицаРезультата.Характеристика КАК Справочник.ХарактеристикиНоменклатуры).бг_УпаковкаПаллета.Наименование КАК АвтоНаименование
		|ИЗ
		|	ТаблицаРезультата КАК ТаблицаРезультата
		|ГДЕ
		|	ВЫРАЗИТЬ(ТаблицаРезультата.Характеристика КАК Справочник.ХарактеристикиНоменклатуры).Наименование 
		|			<> ВЫРАЗИТЬ(ТаблицаРезультата.Характеристика КАК Справочник.ХарактеристикиНоменклатуры).бг_УпаковкаПаллета.Наименование
		|	И НЕ ВЫРАЗИТЬ(ТаблицаРезультата.Характеристика КАК Справочник.ХарактеристикиНоменклатуры).бг_УпаковкаПаллета.Наименование ЕСТЬ NULL
		|";
		#КонецОбласти 
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
	
		// Удалим записи, которые были в регистре, но нет в таблице результата.
		Выборка = РезультатЗапроса[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Набор.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			Набор.Отбор.УпаковкаПаллета.Установить(Выборка.УпаковкаПаллета);
			
			Набор.Записать(Истина);
		КонецЦикла; 
		
		// Запишем измененные записи из таблице результата.
		Выборка = РезультатЗапроса[3].Выбрать();
		Пока Выборка.Следующий() Цикл
			Набор.Очистить();
			
			Набор.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			Набор.Отбор.УпаковкаПаллета.Установить(Выборка.УпаковкаПаллета);
			
			НоваяЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка); 
			
			Набор.Записать(Истина);
		КонецЦикла; 
		
		// Установим новое наименование служебной характеристики, если оно не соответствует наименование паллеты.
		Выборка = РезультатЗапроса[4].Выбрать();
		Пока Выборка.Следующий() Цикл
			ХарактеристикаОбъект = Выборка.Характеристика.ПолучитьОбъект();
			ХарактеристикаОбъект.Наименование = Выборка.АвтоНаименование;
			ХарактеристикаОбъект.НаименованиеПолное = ХарактеристикаОбъект.Наименование;
			ХарактеристикаОбъект.ОбменДанными.Загрузка = Истина;
			ХарактеристикаОбъект.Записать();
		КонецЦикла;	
		
		Если НетВнешнейТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		
		Если НетВнешнейТранзакции Тогда
			ОтменитьТранзакцию();
		КонецЕсли;

		ТекстСообщения = НСтр("ru = 'Не удалось записать характеристики упаковок (паллет): %Причина%';
						      |en = 'Failed to save service variants of packages (pallets). Reason: %Причина%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

Функция ХарактеристикиУпаковокПаллет(Номенклатура)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Создаем пустую таблицу записей регистра.
	ТаблицаРегистра = РегистрыСведений.бг_ХарактеристикиУпаковокПаллет.СоздатьНаборЗаписей().Выгрузить();	

	Если Не ЗначениеЗаполнено(Номенклатура) Тогда 
		Возврат	ТаблицаРегистра;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
	|ГДЕ
	|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
	|	И ЕСТЬNULL(ВЫРАЗИТЬ(УпаковкиЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура).бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет, ЛОЖЬ)
	|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения.бг_ТипЕдиницыИзмерения = ЗНАЧЕНИЕ(Перечисление.бг_ТипыЕдиницИзмерения.Паллета)
	|	И УпаковкиЕдиницыИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка)
	|	И УпаковкиЕдиницыИзмерения.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.Составная)";
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	                                          
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УпаковкаПаллета = Выборка.Ссылка;
		Характеристика = ХарактеристикаУпаковкиПаллеты(Номенклатура, УпаковкаПаллета);
		
		НоваяСтрока = ТаблицаРегистра.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.УпаковкаПаллета = УпаковкаПаллета;
		НоваяСтрока.Характеристика = Характеристика;	
		
		УпаковкаРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УпаковкаПаллета, "Родитель"); 		
		Пока ЗначениеЗаполнено(УпаковкаРодитель) Цикл
			РеквизитыУпаковкиРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УпаковкаРодитель, "ТипИзмеряемойВеличины,ТипУпаковки,Родитель");
			Если РеквизитыУпаковкиРодителя.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка
				И РеквизитыУпаковкиРодителя.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Составная Тогда
			    // Это по идее должна быть коробка.
				НоваяСтрока = ТаблицаРегистра.Добавить();
				НоваяСтрока.Номенклатура = Номенклатура;
				НоваяСтрока.УпаковкаПаллета = УпаковкаРодитель;
				НоваяСтрока.Характеристика = Характеристика;	
			КонецЕсли;
			УпаковкаРодитель = РеквизитыУпаковкиРодителя.Родитель;	
		КонецЦикла;	
		
	КонецЦикла;
	
	Возврат ТаблицаРегистра;
	
КонецФункции	

Функция ХарактеристикаУпаковкиПаллеты(Номенклатура, УпаковкаПаллета)

	УстановитьПривилегированныйРежим(Истина);	
	
	ХарактеристикаУпаковкиПаллеты = Неопределено;
	
	Если Не ЗначениеЗаполнено(Номенклатура) 
		Или Не ЗначениеЗаполнено(УпаковкаПаллета) Тогда
		Возврат ХарактеристикаУпаковкиПаллеты;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("УпаковкаПаллета", УпаковкаПаллета);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Номенклатура
	|	И ХарактеристикиНоменклатуры.бг_УпаковкаПаллета = &УпаковкаПаллета";
	
	РезультататЗапроса = Запрос.Выполнить();
	Если РезультататЗапроса.Пустой() Тогда
	    ХарактеристикаУпаковкиПаллеты = НоваяХарактеристикаУпаковкиПаллеты(Номенклатура, УпаковкаПаллета);
	Иначе	
		Выборка = РезультататЗапроса.Выбрать();
		Выборка.Следующий();
		ХарактеристикаУпаковкиПаллеты = Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат ХарактеристикаУпаковкиПаллеты;
	
КонецФункции	

Функция НоваяХарактеристикаУпаковкиПаллеты(Номенклатура, УпаковкаПаллета)

	УстановитьПривилегированныйРежим(Истина);	
	
	ХарактеристикаУпаковкиПаллеты = Неопределено;
	
	Если Не ЗначениеЗаполнено(Номенклатура) 
		Или Не ЗначениеЗаполнено(УпаковкаПаллета) Тогда
		Возврат ХарактеристикаУпаковкиПаллеты;
	КонецЕсли;
	
	СпрОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	СпрОбъект.Владелец = Номенклатура;
	СпрОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УпаковкаПаллета, "Наименование");
	СпрОбъект.НаименованиеПолное = СпрОбъект.Наименование;
	СпрОбъект.бг_УпаковкаПаллета = УпаковкаПаллета;
	
	
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	СпрОбъект.Записать();
	
    ХарактеристикаУпаковкиПаллеты = СпрОбъект.Ссылка;
	
	Возврат ХарактеристикаУпаковкиПаллеты;	
	
КонецФункции	

#КонецОбласти

#КонецЕсли
